tako0910/py32f0-template/Libraries/PY32F032_LL_Driver/Inc/py32f032_ll_dma.h
  uint32_t TransMode;                 /*!< Specifies data transfer mode.
                                           This parameter can be a value of @ref DMA_LL_EC_Transfer_Mode
                                           @note This configuration is used for data transfer between memory and peripherals,
                                                 not for data transfer between memory and memory. */
  
  uint32_t ArbMode;                   /*!< Specifies arbitration mode.
                                           This parameter can be a value of @ref DMA_LL_EC_Arbitration_Mode
                                           @note This configuration is used for data transfer between memory and memory. */
  
  uint32_t BTCSuspend;               /*!< Specifies BTC interrupt post-processing mode.
                                           This parameter can be a value of @ref DMA_LL_EC_BTC_Suspend
                                           @note This configuration is used for LL_DMA_MODE_FINITE_CIRCULAR mode and
                                                  LL_DMA_MODE_INFINITE_CIRCULAR mode, not for LL_DMA_MODE_NORMAL mode */

} LL_DMA_InitTypeDef;
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup DMA_LL_Exported_Constants DMA Exported Constants
  * @{
  */
/** @defgroup DMA_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_DMA_WriteReg function
  * @{
  */
#define LL_DMA_IFCR_CTCIF1                DMA_IFCR_CTCIF1       /*!< Channel 1 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF1               DMA_IFCR_CBTCIF1      /*!< Channel 1 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF1               DMA_IFCR_CHBTIF1      /*!< Channel 1 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF1                DMA_IFCR_CTEIF1       /*!< Channel 1 transfer error flag    */
#define LL_DMA_IFCR_CTCIF2                DMA_IFCR_CTCIF2       /*!< Channel 2 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF2               DMA_IFCR_CBTCIF2      /*!< Channel 2 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF2               DMA_IFCR_CHBTIF2      /*!< Channel 2 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF2                DMA_IFCR_CTEIF2       /*!< Channel 2 transfer error flag    */
#define LL_DMA_IFCR_CTCIF3                DMA_IFCR_CTCIF3       /*!< Channel 3 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF3               DMA_IFCR_CBTCIF3      /*!< Channel 3 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF3               DMA_IFCR_CHBTIF3      /*!< Channel 3 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF3                DMA_IFCR_CTEIF3       /*!< Channel 3 transfer error flag    */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_DMA_ReadReg function
  * @{
  */
#define LL_DMA_ISR_TCIF1                DMA_ISR_TCIF1       /*!< Channel 1 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF1               DMA_ISR_BTCIF1      /*!< Channel 1 block transfer complete flag */
#define LL_DMA_ISR_HBTIF1               DMA_ISR_HBTIF1      /*!< Channel 1 block half transfer complete flag */
#define LL_DMA_ISR_TEIF1                DMA_ISR_TEIF1       /*!< Channel 1 transfer error flag    */
#define LL_DMA_ISR_TCIF2                DMA_ISR_TCIF2       /*!< Channel 2 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF2               DMA_ISR_BTCIF2      /*!< Channel 2 block transfer complete flag */
#define LL_DMA_ISR_HBTIF2               DMA_ISR_HBTIF2      /*!< Channel 2 block half transfer complete flag */
#define LL_DMA_ISR_TEIF2                DMA_ISR_TEIF2       /*!< Channel 2 transfer error flag    */
#define LL_DMA_ISR_TCIF3                DMA_ISR_TCIF3       /*!< Channel 3 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF3               DMA_ISR_BTCIF3      /*!< Channel 3 block transfer complete flag */
#define LL_DMA_ISR_HBTIF3               DMA_ISR_HBTIF3      /*!< Channel 3 block half transfer complete flag */
#define LL_DMA_ISR_TEIF3                DMA_ISR_TEIF3       /*!< Channel 3 transfer error flag    */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_DMA_ReadReg and  LL_DMA_WriteReg functions
  * @{
  */
#define LL_DMA_CCR_TCIE                   DMA_CCR_TCIE           /*!< All block transfer complete interrupt */
#define LL_DMA_CCR_BTCIE                  DMA_CCR_BTCIE          /*!< Block transfer complete interrupt */
#define LL_DMA_CCR_HBTIE                  DMA_CCR_HBTIE          /*!< Block half transfer complete interrupt     */
#define LL_DMA_CCR_TEIE                   DMA_CCR_TEIE           /*!< Transfer error interrupt    */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_CHANNEL CHANNEL
  * @{
  */
#define LL_DMA_CHANNEL_1                  0x00000001U /*!< DMA Channel 1 */
#define LL_DMA_CHANNEL_2                  0x00000002U /*!< DMA Channel 2 */
#define LL_DMA_CHANNEL_3                  0x00000003U /*!< DMA Channel 3 */
#if defined(USE_FULL_LL_DRIVER)
#define LL_DMA_CHANNEL_ALL                0xFFFF0000U /*!< DMA Channel all (used only for function @ref LL_DMA_DeInit(). */
#endif /*USE_FULL_LL_DRIVER*/
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DIRECTION Transfer Direction
  * @{
  */
#define LL_DMA_DIRECTION_PERIPH_TO_MEMORY 0x00000000U             /*!< Peripheral to memory direction */
#define LL_DMA_DIRECTION_MEMORY_TO_PERIPH DMA_CCR_DIR             /*!< Memory to peripheral direction */
#define LL_DMA_DIRECTION_MEMORY_TO_MEMORY DMA_CCR_MEM2MEM         /*!< Memory to memory direction     */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_MODE Transfer mode
  * @{
  */
#define LL_DMA_MODE_NORMAL               (0x00000000U)               /*!< Normal Mode                  */
#define LL_DMA_MODE_FINITE_CIRCULAR      (0x00000001U)               /*!< Finite Circular Mode         */
#define LL_DMA_MODE_INFINITE_CIRCULAR    (0x00000002U)               /*!< Infinite Circular Mode       */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_PERIPH Peripheral increment mode
  * @{
  */
#define LL_DMA_PERIPH_FIX                 (0x00000000U)               /*!< Peripheral address fixed */
#define LL_DMA_PERIPH_INCREMENT           ((uint32_t)DMA_CCR_PINC_0)  /*!< Peripheral address increment */
#define LL_DMA_PERIPH_DECREMENT           ((uint32_t)DMA_CCR_PINC_1)  /*!< Peripheral address decrement */

/**
  * @}
  */

/** @defgroup DMA_LL_EC_MEMORY Memory increment mode
  * @{
  */

#define LL_DMA_MEMORY_FIX                 (0x00000000U)               /*!< Memory address fixed  */
#define LL_DMA_MEMORY_INCREMENT           ((uint32_t)DMA_CCR_MINC_0)  /*!< Memory address increment */
#define LL_DMA_MEMORY_DECREMENT           ((uint32_t)DMA_CCR_MINC_1)  /*!< Memory address decrement */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_PDATAALIGN Peripheral data alignment
  * @{
  */
#define LL_DMA_PDATAALIGN_BYTE            0x00000000U             /*!< Peripheral data alignment : Byte     */
#define LL_DMA_PDATAALIGN_HALFWORD        DMA_CCR_PSIZE_0         /*!< Peripheral data alignment : HalfWord */
#define LL_DMA_PDATAALIGN_WORD            DMA_CCR_PSIZE_1         /*!< Peripheral data alignment : Word     */
/**
  * @}
  */

