tako0910/py32f0-template/Libraries/PY32F032_LL_Driver/Inc/py32f032_ll_dma.h
  channelmapmsk = 0x3F;

  position = ((uint32_t)Channel - (uint32_t)LL_DMA_CHANNEL_1) / ((uint32_t)LL_DMA_CHANNEL_2 - (uint32_t)LL_DMA_CHANNEL_1);
  
  MODIFY_REG(SYSCFG->CFGR3, (channelmapmsk << (8U * (position & 0x03U))), (MapReqNum << (8U * (position & 0x03U))));
}

/**
  * @brief  Get the DMA Remap
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  * @return  MapReqNum This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DMA_MAP_ADC            
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_RX   
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI1_TX   
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_RX   
  *         @arg @ref LL_SYSCFG_DMA_MAP_SPI2_TX   
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_RX 
  *         @arg @ref LL_SYSCFG_DMA_MAP_USART1_TX 
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART1_RX  
  *         @arg @ref LL_SYSCFG_DMA_MAP_UART1_TX  
  *         @arg @ref LL_SYSCFG_DMA_MAP_LPUART1_RX
  *         @arg @ref LL_SYSCFG_DMA_MAP_LPUART1_TX
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_RX   
  *         @arg @ref LL_SYSCFG_DMA_MAP_I2C1_TX      
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH1  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH2  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH3  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_CH4  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_COM  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_TRG  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM1_UP    
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH1  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH2  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH3  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_CH4  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_UP   
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM3_TRG  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_CH1 
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM16_UP  
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_CH1 
  *         @arg @ref LL_SYSCFG_DMA_MAP_TIM17_UP
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDMARemap(DMA_TypeDef *DMAx,uint32_t Channel)
{
  uint32_t position;
  uint32_t channelmapmsk;

  channelmapmsk = 0x3F;

  position = ((uint32_t)Channel - (uint32_t)LL_DMA_CHANNEL_1) / ((uint32_t)LL_DMA_CHANNEL_2 - (uint32_t)LL_DMA_CHANNEL_1);
  
  return (READ_BIT(SYSCFG->CFGR3, (channelmapmsk << (8U * (position & 0x03U)))) >> (8U * (position & 0x03U)));
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup DMA_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

uint32_t LL_DMA_Init(DMA_TypeDef *DMAx, uint32_t Channel, LL_DMA_InitTypeDef *DMA_InitStruct);
uint32_t LL_DMA_DeInit(DMA_TypeDef *DMAx, uint32_t Channel);
void LL_DMA_StructInit(LL_DMA_InitTypeDef *DMA_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* DMA */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32F032_LL_DMA_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
